app/Controllers/BaseController.php

SELECT `pageTitle`, `sefLink`
FROM `pages`
WHERE `sort` > 0
ORDER BY `sort` ASC
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
       // $this->commonModel = new CommonModel();
       // $this->secondModel = new CommonModel('secondDB');

        //--------------------------------------------------------------------
        // Preload any models, libraries, etc, here.
        //--------------------------------------------------------------------
        // E.g.:
        // $this->session = \Config\Services::session();
        $this->pageModel = new PageModel();
        $this->navs = $this->pageModel->select('pageTitle,sefLink')->where(['sort>' => 0])->orderBy('sort', 'asc')->findAll();