app/Controllers/Home.php

    public function tagList()
    {
        $tagModel = new TagModel();
        $data=['navs'=>$this->navs,
        'tags'=>$tagModel->findAll()];
---
SELECT *
FROM `tags`
WHERE `tags`.`deleted_at` IS NULL