app/Models/BlogModel.php

    public function blogCategories()
    {
        return $this->db->table('blog_categories')->get()->getResultArray();
---
SELECT *
FROM `blog_categories`